# SEMANA 1

In [26]:
import pandas as pd

In [27]:
# Salarios
df = pd.read_csv('http://www.ppgia.pucpr.br/~jean.barddal/datascience/Salaries.csv')

In [28]:
# info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     397 non-null    int64
 1   rank           397 non-null    object
 2   discipline     397 non-null    object
 3   yrs.since.phd  397 non-null    int64
 4   yrs.service    397 non-null    int64
 5   sex            397 non-null    object
 6   salary         397 non-null    int64
dtypes: int64(4), object(3)
memory usage: 21.8+ KB

In [29]:
# describe (estatistica)
df.describe()

       Unnamed: 0  yrs.since.phd  yrs.service         salary
count  397.000000     397.000000   397.000000     397.000000
mean   199.000000      22.314861    17.614610  113706.458438
std    114.748275      12.887003    13.006024   30289.038695
min      1.000000       1.000000     0.000000   57800.000000
25%    100.000000      12.000000     7.000000   91000.000000
50%    199.000000      21.000000    16.000000  107300.000000
75%    298.000000      32.000000    27.000000  134185.000000
max    397.000000      56.000000    60.000000  231545.000000

In [30]:
# head/tail
df.head(5)

   Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
0           1      Prof          B             19           18  Male  139750
1           2      Prof          B             20           16  Male  173200
2           3  AsstProf          B              4            3  Male   79750
3           4      Prof          B             45           39  Male  115000
4           5      Prof          B             40           41  Male  141500

In [31]:
df.tail(5)

     Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
392         393      Prof          A             33           30  Male  103106
393         394      Prof          A             31           19  Male  150564
394         395      Prof          A             42           25  Male  101738
395         396      Prof          A             25           15  Male   95329
396         397  AsstProf          A              8            4  Male   81035

In [32]:
# Apagando uma coluna (axis=1 significa que removeremos uma COLUNA, axis=0 removeria uma linha!)
# df = df.drop('Unnamed: 0', axis=1)
df.drop('Unnamed: 0', axis=1, inplace=True)
df.head(5)

       rank discipline  yrs.since.phd  yrs.service   sex  salary
0      Prof          B             19           18  Male  139750
1      Prof          B             20           16  Male  173200
2  AsstProf          B              4            3  Male   79750
3      Prof          B             45           39  Male  115000
4      Prof          B             40           41  Male  141500

In [33]:
# Selecao de colunas
df['salary'] # -> Series (pandas)

0      139750
1      173200
2       79750
3      115000
4      141500
        ...
392    103106
393    150564
394    101738
395     95329
396     81035
Name: salary, Length: 397, dtype: int64

In [34]:
df[['sex', 'salary']]

      sex  salary
0    Male  139750
1    Male  173200
2    Male   79750
3    Male  115000
4    Male  141500
..    ...     ...
392  Male  103106
393  Male  150564
394  Male  101738
395  Male   95329
396  Male   81035

[397 rows x 2 columns]

In [35]:
# Selecao condicional

# Exemplo: professores que lecionam a disciplina A (discipline)
condicao = df['discipline'] == 'A'
df[condicao]

         rank discipline  yrs.since.phd  yrs.service     sex  salary
17       Prof          A             38           34    Male  103450
18       Prof          A             37           23    Male  124750
19       Prof          A             39           36  Female  137000
20       Prof          A             31           26    Male   89565
21       Prof          A             36           31    Male  102580
..        ...        ...            ...          ...     ...     ...
392      Prof          A             33           30    Male  103106
393      Prof          A             31           19    Male  150564
394      Prof          A             42           25    Male  101738
395      Prof          A             25           15    Male   95329
396  AsstProf          A              8            4    Male   81035

[181 rows x 6 columns]

In [36]:
# Selecao condicional (composta -> E (&), OU (|), NOT (~))

# Exemplo: selecionando professoras da disciplina A do sexo feminino
condicao = (df['discipline'] == 'A') & (df['sex'] == 'Female')
df[condicao]

          rank discipline  yrs.since.phd  yrs.service     sex  salary
19        Prof          A             39           36  Female  137000
24   AssocProf          A             13            8  Female   74830
114       Prof          A             12            0  Female  105000
119   AsstProf          A              5            3  Female   73500
123  AssocProf          A             25           22  Female   62884
127   AsstProf          A              2            0  Female   72500
132  AssocProf          A             10            8  Female   77500
133   AsstProf          A              3            1  Female   72500
230       Prof          A             29           27  Female   91000
231  AssocProf          A             26           24  Female   73300
233       Prof          A             36           19  Female  117555
237   AsstProf          A              7            6  Female   63100
245       Prof          A             17           11  Female   90450
253   AsstProf          A              4            2  Female   77500
254       Prof          A             28            7  Female  116450
274   AsstProf          A              8            3  Female   78500
358       Prof          A             28           14  Female  109954
361       Prof          A             23           15  Female  109646

In [37]:
# Selecionando uma celula especifica (indice de linha e de coluna)
# Exemplo: obtendo a linha com indice 133 e coluna sex
df.loc[133]['sex']

'Female'

In [38]:
# condicao com o valor que voce deseja
df[df == 39]

    rank discipline  yrs.since.phd  yrs.service  sex  salary
0    NaN        NaN            NaN          NaN  NaN     NaN
1    NaN        NaN            NaN          NaN  NaN     NaN
2    NaN        NaN            NaN          NaN  NaN     NaN
3    NaN        NaN            NaN         39.0  NaN     NaN
4    NaN        NaN            NaN          NaN  NaN     NaN
..   ...        ...            ...          ...  ...     ...
392  NaN        NaN            NaN          NaN  NaN     NaN
393  NaN        NaN            NaN          NaN  NaN     NaN
394  NaN        NaN            NaN          NaN  NaN     NaN
395  NaN        NaN            NaN          NaN  NaN     NaN
396  NaN        NaN            NaN          NaN  NaN     NaN

[397 rows x 6 columns]

In [39]:
# Calcular o salario medio das professorAs da disciplina B
# condicao (sexo feminino E disciplina B) 
# media do salario
df[(df['sex'] == 'Female') & (df['discipline'] == 'B')]['salary'].mean()

111234.52380952382

In [40]:
# Ordenacao
df.sort_values(['discipline', 'salary'], ascending=[False, True])

          rank discipline  yrs.since.phd  yrs.service     sex  salary
317       Prof          B             46           45    Male   67559
64    AsstProf          B              4            3    Male   68404
49    AsstProf          B              1            1    Male   70768
316  AssocProf          B             12            9  Female   71065
75    AsstProf          B              8            3    Male   73266
..         ...        ...            ...          ...     ...     ...
292       Prof          A             39            9    Male  183800
389       Prof          A             33           18    Male  186023
271       Prof          A             42           18    Male  194800
249       Prof          A             29            7    Male  204000
364       Prof          A             43           43    Male  205500

[397 rows x 6 columns]

In [41]:
# Estatisticas
# calcular salario medio
df['salary'].mean()

113706.45843828715

In [42]:
# min
df['salary'].min()

57800

In [43]:
# max
df['salary'].max()

231545

In [44]:
# mediana
df['salary'].median()

107300.0

In [45]:
# moda
df['salary'].mode()

0    92000
dtype: int64

In [46]:
# Existe diferenca no salario medio entre professores do sexo masculino e feminino?
print(f"Female: {df[(df['sex'] == 'Female')]['salary'].mean()}")
print(f"Male: {df[(df['sex'] == 'Male')]['salary'].mean()}")

Female: 101002.41025641025
Male: 115090.41899441341

In [47]:
# Group by
df.groupby('sex')['salary'].mean()

sex
Female    101002.410256
Male      115090.418994
Name: salary, dtype: float64

In [48]:
df.groupby(['sex', 'rank'])['salary'].mean()

sex     rank
Female  AssocProf     88512.800000
        AsstProf      78049.909091
        Prof         121967.611111
Male    AssocProf     94869.703704
        AsstProf      81311.464286
        Prof         127120.822581
Name: salary, dtype: float64

In [49]:
df.groupby(['sex', 'rank'])['salary'].count()

sex     rank
Female  AssocProf     10
        AsstProf      11
        Prof          18
Male    AssocProf     54
        AsstProf      56
        Prof         248
Name: salary, dtype: int64

In [51]:
# salario medio e quantidade junto na mesma tabela?
# import numpy as np
# agg -> aggregate
df.groupby(['sex', 'rank'])['salary'].agg(['mean', 'median', 'count'])

                           mean    median  count
sex    rank
Female AssocProf   88512.800000   90556.5     10
       AsstProf    78049.909091   77000.0     11
       Prof       121967.611111  120257.5     18
Male   AssocProf   94869.703704   95626.5     54
       AsstProf    81311.464286   80182.0     56
       Prof       127120.822581  123996.0    248

In [55]:
# Conversao de texto para caixa alta/baixa (upper/lower)
df['rank'] = df['rank'].str.lower()

In [64]:
# applymap (aplica uma funcao em cada celula da tabela)
df = df.applymap(lambda s: s.upper() if type(s) == str else s)

In [65]:
# apply

In [66]:
df.head(5)

       rank discipline  yrs.since.phd  yrs.service   sex  salary
0      PROF          B             19           18  MALE  139750
1      PROF          B             20           16  MALE  173200
2  ASSTPROF          B              4            3  MALE   79750
3      PROF          B             45           39  MALE  115000
4      PROF          B             40           41  MALE  141500

In [67]:
# Construçao de novas features (colunas/variáveis/atributos)
# Feature engineering

In [69]:
# Criar uma coluna nova baseado em calculo sobre colunas existentes
# dif doutorado e trabalho = yrs.since.phd - yrs.service
df['dif_doutorado_trabalho'] = df['yrs.since.phd'] - df['yrs.service']

In [70]:
df.head(5)

       rank discipline  yrs.since.phd  ...   sex  salary  dif_doutorado_trabalho
0      PROF          B             19  ...  MALE  139750                       1
1      PROF          B             20  ...  MALE  173200                       4
2  ASSTPROF          B              4  ...  MALE   79750                       1
3      PROF          B             45  ...  MALE  115000                       6
4      PROF          B             40  ...  MALE  141500                      -1

[5 rows x 7 columns]

In [ ]:
# Apply (coluna ou linha)
def tratamento(x):
  if x == 'PROF':
    return 'Professor'
  elif x == 'ASSTPROF':
    return 'Professor Assistente'
  else: 
    return 'Professor Associado'

df['rank'].apply(tratamento)

In [75]:
# Verdadeiro se sexo == MALE and salary > 150000
def tratamento_duas_colunas(r):
  return r['salary'] > 150000 and r['sex'] == 'MALE'    

df['condicao com duas colunas'] = df.apply(tratamento_duas_colunas, axis=1)
# axis = 1 significa que a funcao recebe cada linha individualmente
# desta forma, a funcao deve tratar a linha e nao a celula (como era no apply normal)

In [76]:
df.head(5)

       rank discipline  ...  dif_doutorado_trabalho  condicao com duas colunas
0      PROF          B  ...                       1                      False
1      PROF          B  ...                       4                       True
2  ASSTPROF          B  ...                       1                      False
3      PROF          B  ...                       6                      False
4      PROF          B  ...                      -1                      False

[5 rows x 8 columns]